USE module_5_matskiv;
GO

/*Запити з використанням під-запитів*/

/*1.	Отримати номери виробів, для яких всі деталі постачає постачальник 3*/

/*2.	Отримати номера і прізвища постачальників, які постачають деталі для якого-небудь виробу з деталлю 1 в кількості більшій, ніж середній об’єм поставок деталі 1 для цього виробу*/

/*3.	Отримати повний список деталей для всіх виробів, які виготовляються в Лондоні*/

/*4.	Показати номери і назви постачальників, що постачають принаймні одну червону деталь*/

/*5.	Показати номери деталей, які використовуються принаймні в одному виробі, який поставляється постачальником 2*/

/*6.	Отримати номери виробів, для яких середній об’єм поставки деталей  більший за найбільший об’єм поставки будь-якої деталі для виробу 1*/

/*7.	Вибрати вироби, що ніколи не постачались (під-запит)*/


/*UNION, UNION ALL , EXCEPT, INTERSECT*/

/*8.	Вибрати постачальників з Лондона або Парижу*/

/*9.	Вибрати всі міста, де є постачальники  і/або деталі (два запити – перший повертає міста з дублікатами, другий без дублікатів) . Міста у кожному запиті  відсортувати в алфавітному порядку */

/*10.	Вибрати всіх постачальників за вийнятком тих, що постачають деталі з Лондона */

/*11.	Знайти різницю між множиною продуктів, які знаходяться в Лондоні та Парижі  і множиною продуктів, які знаходяться в Парижі та Римі*/

/*12.	Вибрати поставки, що зробив постачальник з Лондона, а також поставки зелених деталей за виключенням поставлених виробів з Парижу (код постачальника, код деталі, код виробу)*/



/*Запити використовуючи CTE  або Hierarchical queries*/

/*13.	Написати довільний запит з двома СТЕ  (в одному є звертання до іншого) */

/*14. Обчислити за допомогою рекурсивної CTE факторіал від 10  та вивести у форматі таблиці з колонками Position та Value */

/*15.	Обчислити за допомогою рекурсивної CTE перші 20 елементів ряду Фібоначчі та вивести у форматі таблиці з колонками Position та Value  */

/*16.	Розділити вхідний період 2013-11-25 до 2014-03-05 на періоди по календарним місяцям за допомогою рекурсивної CTE та вивести у форматі таблиці з колонками StartDate та EndDate  */

/*17.	Розрахувати календар поточного місяця за допомогою рекурсивної CTE та вивести дні місяця у форматі таблиці з колонками Monday,Tuesday,Wednesday,Thursday,Friday,Saturday,Sunday*/

/*18.	Написати запит  який повертає регіони першого рівня (результат нижче)*/
  
/*19.	Написати запит який повертає під-дерево для конкретного регіону  (наприклад, Івано-Франківськ). Результат має виглядати наступним чином (колонки можуть називатися інакше)*/
  
/*20.	Написати запит котрий вертає повне дерево  від root ('Ukraine') і додаткову колонку, яка вказує на рівень в ієрархії*/
  
/*21.	Написати запит який повертає дерево для регіону Lviv */
  
/*22.	Написати запит який повертає дерево зі шляхами для регіону Lviv*/
  
/*23.	Написати запит, який повертає дерево  зі шляхами і довжиною шляхів для регіону Lviv*/